; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-30-28)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 room30 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 - object)
(:init
(at-robby robot1 room30)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room1)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room28)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room25)
(at ball2 room22)
(at ball3 room24)
(at ball4 room28)
(at ball5 room29)
(at ball6 room6)
(at ball7 room29)
(at ball8 room4)
(at ball9 room2)
(at ball10 room23)
(at ball11 room27)
(at ball12 room13)
(at ball13 room20)
(at ball14 room7)
(at ball15 room13)
(at ball16 room18)
(at ball17 room25)
(at ball18 room18)
(at ball19 room25)
(at ball20 room10)
(at ball21 room25)
(at ball22 room21)
(at ball23 room4)
(at ball24 room13)
(at ball25 room15)
(at ball26 room5)
(at ball27 room21)
(at ball28 room11)
)
(:goal
(and
(at ball1 room4)
(at ball2 room21)
(at ball3 room8)
(at ball4 room29)
(at ball5 room13)
(at ball6 room2)
(at ball7 room26)
(at ball8 room11)
(at ball9 room7)
(at ball10 room24)
(at ball11 room15)
(at ball12 room9)
(at ball13 room17)
(at ball14 room12)
(at ball15 room21)
(at ball16 room6)
(at ball17 room18)
(at ball18 room4)
(at ball19 room24)
(at ball20 room13)
(at ball21 room22)
(at ball22 room18)
(at ball23 room22)
(at ball24 room16)
(at ball25 room8)
(at ball26 room26)
(at ball27 room29)
(at ball28 room22)
)
)
)

; plan
1. (pick robot3 ball4 room28 lgripper3)
   deleted: (at ball4 room28) (free robot3 lgripper3)
   added: (carry robot3 ball4 lgripper3)
   goals met: 0 of 28
2. (move robot1 room30 room9)
   deleted: (at-robby robot1 room30)
   added: (at-robby robot1 room9)
   goals met: 0 of 28
3. (move robot2 room1 room29)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room29)
   goals met: 0 of 28
4. (move robot3 room28 room29)
   deleted: (at-robby robot3 room28)
   added: (at-robby robot3 room29)
   goals met: 0 of 28
5. (pick robot2 ball7 room29 lgripper2)
   deleted: (at ball7 room29) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 0 of 28
6. (move robot1 room9 room8)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room8)
   goals met: 0 of 28
7. (drop robot3 ball4 room29 lgripper3)
   deleted: (carry robot3 ball4 lgripper3)
   added: (at ball4 room29) (free robot3 lgripper3)
   goals met: 1 of 28
8. (move robot2 room29 room5)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room5)
   goals met: 1 of 28
9. (pick robot3 ball5 room29 rgripper3)
   deleted: (at ball5 room29) (free robot3 rgripper3)
   added: (carry robot3 ball5 rgripper3)
   goals met: 1 of 28
10. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 1 of 28
11. (pick robot2 ball26 room5 rgripper2)
   deleted: (at ball26 room5) (free robot2 rgripper2)
   added: (carry robot2 ball26 rgripper2)
   goals met: 1 of 28
12. (move robot3 room29 room13)
   deleted: (at-robby robot3 room29)
   added: (at-robby robot3 room13)
   goals met: 1 of 28
13. (move robot1 room9 room20)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room20)
   goals met: 1 of 28
14. (move robot2 room5 room26)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room26)
   goals met: 1 of 28
15. (drop robot3 ball5 room13 rgripper3)
   deleted: (carry robot3 ball5 rgripper3)
   added: (at ball5 room13) (free robot3 rgripper3)
   goals met: 2 of 28
16. (pick robot3 ball24 room13 lgripper3)
   deleted: (at ball24 room13) (free robot3 lgripper3)
   added: (carry robot3 ball24 lgripper3)
   goals met: 2 of 28
17. (pick robot1 ball13 room20 lgripper1)
   deleted: (at ball13 room20) (free robot1 lgripper1)
   added: (carry robot1 ball13 lgripper1)
   goals met: 2 of 28
18. (drop robot2 ball7 room26 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room26) (free robot2 lgripper2)
   goals met: 3 of 28
19. (drop robot2 ball26 room26 rgripper2)
   deleted: (carry robot2 ball26 rgripper2)
   added: (at ball26 room26) (free robot2 rgripper2)
   goals met: 4 of 28
20. (move robot1 room20 room17)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room17)
   goals met: 4 of 28
21. (move robot3 room13 room16)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room16)
   goals met: 4 of 28
22. (drop robot1 ball13 room17 lgripper1)
   deleted: (carry robot1 ball13 lgripper1)
   added: (at ball13 room17) (free robot1 lgripper1)
   goals met: 5 of 28
23. (drop robot3 ball24 room16 lgripper3)
   deleted: (carry robot3 ball24 lgripper3)
   added: (at ball24 room16) (free robot3 lgripper3)
   goals met: 6 of 28
24. (move robot2 room26 room7)
   deleted: (at-robby robot2 room26)
   added: (at-robby robot2 room7)
   goals met: 6 of 28
25. (pick robot2 ball14 room7 lgripper2)
   deleted: (at ball14 room7) (free robot2 lgripper2)
   added: (carry robot2 ball14 lgripper2)
   goals met: 6 of 28
26. (move robot3 room16 room9)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room9)
   goals met: 6 of 28
27. (move robot1 room17 room9)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room9)
   goals met: 6 of 28
28. (move robot2 room7 room12)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room12)
   goals met: 6 of 28
29. (move robot1 room9 room27)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room27)
   goals met: 6 of 28
30. (move robot3 room9 room11)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room11)
   goals met: 6 of 28
31. (drop robot2 ball14 room12 lgripper2)
   deleted: (carry robot2 ball14 lgripper2)
   added: (at ball14 room12) (free robot2 lgripper2)
   goals met: 7 of 28
32. (pick robot1 ball11 room27 lgripper1)
   deleted: (at ball11 room27) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 7 of 28
33. (pick robot3 ball28 room11 lgripper3)
   deleted: (at ball28 room11) (free robot3 lgripper3)
   added: (carry robot3 ball28 lgripper3)
   goals met: 7 of 28
34. (move robot1 room27 room15)
   deleted: (at-robby robot1 room27)
   added: (at-robby robot1 room15)
   goals met: 7 of 28
35. (move robot3 room11 room13)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room13)
   goals met: 7 of 28
36. (move robot2 room12 room9)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room9)
   goals met: 7 of 28
37. (drop robot1 ball11 room15 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room15) (free robot1 lgripper1)
   goals met: 8 of 28
38. (pick robot1 ball25 room15 rgripper1)
   deleted: (at ball25 room15) (free robot1 rgripper1)
   added: (carry robot1 ball25 rgripper1)
   goals met: 8 of 28
39. (pick robot3 ball15 room13 rgripper3)
   deleted: (at ball15 room13) (free robot3 rgripper3)
   added: (carry robot3 ball15 rgripper3)
   goals met: 8 of 28
40. (move robot2 room9 room6)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room6)
   goals met: 8 of 28
41. (move robot1 room15 room8)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room8)
   goals met: 8 of 28
42. (move robot3 room13 room22)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room22)
   goals met: 8 of 28
43. (pick robot2 ball6 room6 lgripper2)
   deleted: (at ball6 room6) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 8 of 28
44. (drop robot1 ball25 room8 rgripper1)
   deleted: (carry robot1 ball25 rgripper1)
   added: (at ball25 room8) (free robot1 rgripper1)
   goals met: 9 of 28
45. (drop robot3 ball28 room22 lgripper3)
   deleted: (carry robot3 ball28 lgripper3)
   added: (at ball28 room22) (free robot3 lgripper3)
   goals met: 10 of 28
46. (move robot2 room6 room2)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room2)
   goals met: 10 of 28
47. (move robot3 room22 room21)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room21)
   goals met: 10 of 28
48. (drop robot2 ball6 room2 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room2) (free robot2 lgripper2)
   goals met: 11 of 28
49. (pick robot2 ball9 room2 rgripper2)
   deleted: (at ball9 room2) (free robot2 rgripper2)
   added: (carry robot2 ball9 rgripper2)
   goals met: 11 of 28
50. (move robot1 room8 room9)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room9)
   goals met: 11 of 28
51. (drop robot3 ball15 room21 rgripper3)
   deleted: (carry robot3 ball15 rgripper3)
   added: (at ball15 room21) (free robot3 rgripper3)
   goals met: 12 of 28
52. (move robot2 room2 room7)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room7)
   goals met: 12 of 28
53. (pick robot3 ball27 room21 lgripper3)
   deleted: (at ball27 room21) (free robot3 lgripper3)
   added: (carry robot3 ball27 lgripper3)
   goals met: 12 of 28
54. (move robot1 room9 room4)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room4)
   goals met: 12 of 28
55. (drop robot2 ball9 room7 rgripper2)
   deleted: (carry robot2 ball9 rgripper2)
   added: (at ball9 room7) (free robot2 rgripper2)
   goals met: 13 of 28
56. (move robot3 room21 room29)
   deleted: (at-robby robot3 room21)
   added: (at-robby robot3 room29)
   goals met: 13 of 28
57. (pick robot1 ball8 room4 lgripper1)
   deleted: (at ball8 room4) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 13 of 28
58. (drop robot3 ball27 room29 lgripper3)
   deleted: (carry robot3 ball27 lgripper3)
   added: (at ball27 room29) (free robot3 lgripper3)
   goals met: 14 of 28
59. (move robot1 room4 room11)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room11)
   goals met: 14 of 28
60. (move robot2 room7 room24)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room24)
   goals met: 14 of 28
61. (drop robot1 ball8 room11 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room11) (free robot1 lgripper1)
   goals met: 15 of 28
62. (pick robot2 ball3 room24 lgripper2)
   deleted: (at ball3 room24) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 15 of 28
63. (move robot3 room29 room9)
   deleted: (at-robby robot3 room29)
   added: (at-robby robot3 room9)
   goals met: 15 of 28
64. (move robot2 room24 room8)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room8)
   goals met: 15 of 28
65. (move robot1 room11 room9)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room9)
   goals met: 15 of 28
66. (move robot3 room9 room4)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room4)
   goals met: 15 of 28
67. (drop robot2 ball3 room8 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room8) (free robot2 lgripper2)
   goals met: 16 of 28
68. (pick robot3 ball23 room4 lgripper3)
   deleted: (at ball23 room4) (free robot3 lgripper3)
   added: (carry robot3 ball23 lgripper3)
   goals met: 16 of 28
69. (move robot1 room9 room22)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room22)
   goals met: 16 of 28
70. (move robot3 room4 room22)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room22)
   goals met: 16 of 28
71. (move robot2 room8 room9)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room9)
   goals met: 16 of 28
72. (pick robot1 ball2 room22 lgripper1)
   deleted: (at ball2 room22) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 16 of 28
73. (drop robot3 ball23 room22 lgripper3)
   deleted: (carry robot3 ball23 lgripper3)
   added: (at ball23 room22) (free robot3 lgripper3)
   goals met: 17 of 28
74. (move robot1 room22 room21)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room21)
   goals met: 17 of 28
75. (move robot2 room9 room25)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room25)
   goals met: 17 of 28
76. (drop robot1 ball2 room21 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room21) (free robot1 lgripper1)
   goals met: 18 of 28
77. (pick robot1 ball22 room21 rgripper1)
   deleted: (at ball22 room21) (free robot1 rgripper1)
   added: (carry robot1 ball22 rgripper1)
   goals met: 18 of 28
78. (move robot3 room22 room9)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room9)
   goals met: 18 of 28
79. (pick robot2 ball21 room25 lgripper2)
   deleted: (at ball21 room25) (free robot2 lgripper2)
   added: (carry robot2 ball21 lgripper2)
   goals met: 18 of 28
80. (pick robot2 ball19 room25 rgripper2)
   deleted: (at ball19 room25) (free robot2 rgripper2)
   added: (carry robot2 ball19 rgripper2)
   goals met: 18 of 28
81. (move robot1 room21 room18)
   deleted: (at-robby robot1 room21)
   added: (at-robby robot1 room18)
   goals met: 18 of 28
82. (move robot2 room25 room24)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room24)
   goals met: 18 of 28
83. (move robot3 room9 room23)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room23)
   goals met: 18 of 28
84. (drop robot1 ball22 room18 rgripper1)
   deleted: (carry robot1 ball22 rgripper1)
   added: (at ball22 room18) (free robot1 rgripper1)
   goals met: 19 of 28
85. (pick robot1 ball16 room18 lgripper1)
   deleted: (at ball16 room18) (free robot1 lgripper1)
   added: (carry robot1 ball16 lgripper1)
   goals met: 19 of 28
86. (drop robot2 ball19 room24 rgripper2)
   deleted: (carry robot2 ball19 rgripper2)
   added: (at ball19 room24) (free robot2 rgripper2)
   goals met: 20 of 28
87. (pick robot3 ball10 room23 lgripper3)
   deleted: (at ball10 room23) (free robot3 lgripper3)
   added: (carry robot3 ball10 lgripper3)
   goals met: 20 of 28
88. (move robot3 room23 room24)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room24)
   goals met: 20 of 28
89. (move robot2 room24 room22)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room22)
   goals met: 20 of 28
90. (move robot1 room18 room6)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room6)
   goals met: 20 of 28
91. (drop robot3 ball10 room24 lgripper3)
   deleted: (carry robot3 ball10 lgripper3)
   added: (at ball10 room24) (free robot3 lgripper3)
   goals met: 21 of 28
92. (drop robot2 ball21 room22 lgripper2)
   deleted: (carry robot2 ball21 lgripper2)
   added: (at ball21 room22) (free robot2 lgripper2)
   goals met: 22 of 28
93. (drop robot1 ball16 room6 lgripper1)
   deleted: (carry robot1 ball16 lgripper1)
   added: (at ball16 room6) (free robot1 lgripper1)
   goals met: 23 of 28
94. (move robot2 room22 room9)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room9)
   goals met: 23 of 28
95. (move robot3 room24 room9)
   deleted: (at-robby robot3 room24)
   added: (at-robby robot3 room9)
   goals met: 23 of 28
96. (move robot1 room6 room9)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room9)
   goals met: 23 of 28
97. (move robot1 room9 room10)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room10)
   goals met: 23 of 28
98. (move robot2 room9 room13)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room13)
   goals met: 23 of 28
99. (move robot3 room9 room4)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room4)
   goals met: 23 of 28
100. (pick robot1 ball20 room10 lgripper1)
   deleted: (at ball20 room10) (free robot1 lgripper1)
   added: (carry robot1 ball20 lgripper1)
   goals met: 23 of 28
101. (pick robot2 ball12 room13 lgripper2)
   deleted: (at ball12 room13) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 23 of 28
102. (move robot3 room4 room25)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room25)
   goals met: 23 of 28
103. (move robot1 room10 room13)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room13)
   goals met: 23 of 28
104. (move robot2 room13 room9)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room9)
   goals met: 23 of 28
105. (pick robot3 ball17 room25 lgripper3)
   deleted: (at ball17 room25) (free robot3 lgripper3)
   added: (carry robot3 ball17 lgripper3)
   goals met: 23 of 28
106. (pick robot3 ball1 room25 rgripper3)
   deleted: (at ball1 room25) (free robot3 rgripper3)
   added: (carry robot3 ball1 rgripper3)
   goals met: 23 of 28
107. (drop robot1 ball20 room13 lgripper1)
   deleted: (carry robot1 ball20 lgripper1)
   added: (at ball20 room13) (free robot1 lgripper1)
   goals met: 24 of 28
108. (drop robot2 ball12 room9 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room9) (free robot2 lgripper2)
   goals met: 25 of 28
109. (move robot3 room25 room4)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room4)
   goals met: 25 of 28
110. (drop robot3 ball1 room4 rgripper3)
   deleted: (carry robot3 ball1 rgripper3)
   added: (at ball1 room4) (free robot3 rgripper3)
   goals met: 26 of 28
111. (move robot1 room13 room4)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room4)
   goals met: 26 of 28
112. (move robot2 room9 room4)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room4)
   goals met: 26 of 28
113. (move robot3 room4 room18)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room18)
   goals met: 26 of 28
114. (drop robot3 ball17 room18 lgripper3)
   deleted: (carry robot3 ball17 lgripper3)
   added: (at ball17 room18) (free robot3 lgripper3)
   goals met: 27 of 28
115. (pick robot3 ball18 room18 rgripper3)
   deleted: (at ball18 room18) (free robot3 rgripper3)
   added: (carry robot3 ball18 rgripper3)
   goals met: 27 of 28
116. (move robot3 room18 room4)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room4)
   goals met: 27 of 28
117. (drop robot3 ball18 room4 rgripper3)
   deleted: (carry robot3 ball18 rgripper3)
   added: (at ball18 room4) (free robot3 rgripper3)
   goals met: 28 of 28
